e2e/perf/k6/results/hot-sku-burst-r1-order-lines.log
== 1/3 基礎設施 ==
 Network order-promising-e2e-perf_default Creating 
 Network order-promising-e2e-perf_default Created 
 Container order-promising-e2e-perf-kafka-1 Creating 
 Container order-promising-e2e-perf-postgres-1 Creating 
 Container order-promising-e2e-perf-postgres-1 Created 
 Container order-promising-e2e-perf-kafka-1 Created 
 Container order-promising-e2e-perf-kafka-ui-1 Creating 
 Container order-promising-e2e-perf-kafka-connect-1 Creating 
 Container order-promising-e2e-perf-kafka-ui-1 Created 
 Container order-promising-e2e-perf-kafka-connect-1 Created 
 Container order-promising-e2e-perf-kafka-1 Starting 
 Container order-promising-e2e-perf-postgres-1 Starting 
 Container order-promising-e2e-perf-kafka-1 Started 
 Container order-promising-e2e-perf-kafka-1 Waiting 
 Container order-promising-e2e-perf-postgres-1 Started 
 Container order-promising-e2e-perf-kafka-1 Waiting 
 Container order-promising-e2e-perf-postgres-1 Waiting 
 Container order-promising-e2e-perf-kafka-1 Healthy 
 Container order-promising-e2e-perf-kafka-ui-1 Starting 
 Container order-promising-e2e-perf-postgres-1 Healthy 
 Container order-promising-e2e-perf-kafka-1 Healthy 
 Container order-promising-e2e-perf-kafka-connect-1 Starting 
 Container order-promising-e2e-perf-kafka-connect-1 Started 
 Container order-promising-e2e-perf-kafka-ui-1 Started 

== 2/3 app（偵測到已在跑會跳過啟動） ==
啟動 app（partition-key-strategy=order-id），log 寫到 /tmp/order-promising-e2e-perf.log
等待 app 就緒...

== 3/3 Debezium connector（偵測到已 RUNNING 會跳過註冊） ==
等待 Kafka Connect REST API（http://localhost:8083）就緒...
註冊 connector 'order-promising-outbox' ...
{"name":"order-promising-outbox","config":{"connector.class":"io.debezium.connector.postgresql.PostgresConnector","database.hostname":"postgres","database.port":"5432","database.user":"order_promising","database.password":"[redacted-dev-password]","database.dbname":"order_promising","plugin.name":"pgoutput","topic.prefix":"order-promising","table.include.list":"public.event_outbox","slot.name":"order_promising_outbox_slot","publication.autocreate.mode":"filtered","transforms":"outbox","transforms.outbox.type":"io.debezium.transforms.outbox.EventRouter","transforms.outbox.route.by.field":"route","transforms.outbox.route.topic.replacement":"${routedByValue}","transforms.outbox.table.field.event.key":"partition_key","transforms.outbox.table.expand.json.payload":"true","transforms.outbox.table.fields.additional.placement":"type:header:eventType","key.converter":"org.apache.kafka.connect.storage.StringConverter","value.converter":"org.apache.kafka.connect.json.JsonConverter","value.converter.schemas.enable":"false","name":"order-promising-outbox"},"tasks":[],"type":"source"}等待 connector 'order-promising-outbox' 進入 RUNNING 狀態...
Connector 'order-promising-outbox' 已經是 RUNNING。

系統已就緒：app http://localhost:8080、Kafka UI http://localhost:8081
要開操作台：cd frontend && npm install && npm run dev
要跑壓測：./e2e/perf/run.sh perf

== 種庫存（SKU=HOT-SKU STOCK=500） ==
INSERT 0 1
INSERT 0 1
INSERT 0 1
[...]
已種好 HOT-SKU：貨主 PERF-OWNER、on_hand_quantity=500

== 跑 k6（VUS=1000） ==

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: e2e/perf/k6/hot-sku-burst.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 2m30s max duration (incl. graceful stop):
              * hot_sku_burst: 1 iterations for each of 1000 VUs (maxDuration: 2m0s, gracefulStop: 30s)


running (0m00.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
hot_sku_burst   [   0% ] 1000 VUs  0m00.9s/2m0s  0000/1000 iters, 1 per VU

running (0m01.9s), 0959/1000 VUs, 41 complete and 0 interrupted iterations
hot_sku_burst   [   4% ] 1000 VUs  0m01.9s/2m0s  0041/1000 iters, 1 per VU

running (0m02.9s), 0869/1000 VUs, 131 complete and 0 interrupted iterations
hot_sku_burst   [  13% ] 1000 VUs  0m02.9s/2m0s  0131/1000 iters, 1 per VU

running (0m03.9s), 0721/1000 VUs, 279 complete and 0 interrupted iterations
hot_sku_burst   [  28% ] 1000 VUs  0m03.9s/2m0s  0279/1000 iters, 1 per VU

running (0m04.9s), 0517/1000 VUs, 483 complete and 0 interrupted iterations
hot_sku_burst   [  48% ] 1000 VUs  0m04.9s/2m0s  0483/1000 iters, 1 per VU

running (0m05.9s), 0093/1000 VUs, 907 complete and 0 interrupted iterations
hot_sku_burst   [  91% ] 1000 VUs  0m05.9s/2m0s  0907/1000 iters, 1 per VU


  █ THRESHOLDS 

    checks
    ✓ 'rate==1.0' rate=100.00%

    order_allocated_total
    ✓ 'count<=500' count=500

    order_decision_latency_ms
    ✓ 'p(99)<10000' p(99)=5.09s

    order_decision_timeout_total
    ✓ 'count==0' count=0


  █ TOTAL RESULTS 

    checks_total.......: 1000    163.637197/s
    checks_succeeded...: 100.00% 1000 out of 1000
    checks_failed......: 0.00%   0 out of 1000

    ✓ order placed (200)

    CUSTOM
    order_allocated_total..........: 500    81.818598/s
    order_backordered_total........: 500    81.818598/s
    order_decision_latency_ms......: avg=3.97s   min=923ms med=4.01s  max=5.11s p(90)=5.06s   p(95)=5.08s    p(99)=5.09s   
    order_decision_timeout_total...: 0      0/s

    HTTP
    http_req_duration..............: avg=36.05ms min=343µs med=1.36ms max=1.06s p(90)=32.93ms p(95)=222.34ms p(99)=804.64ms
      { expected_response:true }...: avg=36.05ms min=343µs med=1.36ms max=1.06s p(90)=32.93ms p(95)=222.34ms p(99)=804.64ms
    http_req_failed................: 0.00%  0 out of 34608
    http_reqs......................: 34608  5663.156103/s

    EXECUTION
    iteration_duration.............: avg=4.57s   min=1.15s med=4.95s  max=6.08s p(90)=5.9s    p(95)=5.97s    p(99)=6.02s   
    iterations.....................: 1000   163.637197/s
    vus............................: 90     min=90         max=1000
    vus_max........................: 1000   min=1000       max=1000

    NETWORK
    data_received..................: 19 MB  3.2 MB/s
    data_sent......................: 4.2 MB 684 kB/s



running (0m06.1s), 0000/1000 VUs, 1000 complete and 0 interrupted iterations
hot_sku_burst ✓ [ 100% ] 1000 VUs  0m06.1s/2m0s  1000/1000 iters, 1 per VU

結果存到 e2e/perf/k6/results/hot-sku-burst-r1-order-lines.json
驗證衝突率／DB 狀態：./e2e/perf/run.sh verify HOT-SKU